app/controllers/posts_controller.rb

  def index

		@posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT 1

  def create
		@post = Post.new(post_params)

		if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)